import re


string = """
Напишите регулярное выражение, которое будет находить
в исходном тексте все домены третьего уровня

Например, в тексте "https://my.space.com/index.php"
регулярное выражение должно найти "my.space.com"

Требования:
- Должны находиться домены только третьего уровня
- Минимальная длина каждой части домена - 1 знак
- Домен 1 уровня должен состоять только из знаков латинского алфавита, остальные части -
  из знаков латинского алфавита, цифр или знака "-".
- Домены регистро независимые
- Каждая часть домена не должна начинаться и/или заканчиваться на "-"
  или содержать "--"
- домены должны находиться по всему тексту, в т.ч. в составе ссылок


текст, который можно потестировать:
валидные домены: a.b.c, ftp://d-9.1foo-bar2.lolipop/index.php, 1.2.co, LOL1.FOO-bar.COM.
невалидные домены: a.c_d.com, com..kz, .com.kz.lol,  ab.do.-com, ab.-do.com,
a--b.do.com, 1.2.3, four.level.domain.com
"""


pattern = r'(?<!\.)\b(?!-)[A-z0-9-]+\.(?!-)[A-z0-9-]+\.(?!-)[A-z]{1,}\b(?!\.\S)'
print('findall:', re.findall(pattern, string))
